In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use("dark_background")

In [2]:
df = pd.read_csv("YT_ds_channels.csv")
df.head()

,youtuber,id,uploads,subscribers,video views,country,account created,estimated monthly income
0,3Blue1Brown,@3blue1brown,127,4.91M,316927667,US,"Mar 3rd, 2015",$844 - $13.5K
1,Joma Tech,@jomaoppa,107,2.06M,164892515,US,"Aug 31st, 2016",$711 - $11.4K
2,The Coding Train,@thecodingtrain,1210,1.54M,110960063,US,"Jul 3rd, 2006",$229 - $3.7K
3,sentdex,@sentdex,1233,1.2M,107212166,US,"Dec 16th, 2012",$214 - $3.4K
4,Tech With Tim,@techwithtim,772,1.14M,102224704,CA,"Apr 23rd, 2014",$516 - $8.3K